package com.example.kathaapp;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.TextView;

public class ReadStory extends AppCompatActivity {
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);


        setContentView(R.layout.activity_read_story);


        Button btnBac = findViewById(R.id.btnBack);
        TextView txtT = findViewById(R.id.txtTitle);
        ImageView imgT = findViewById(R.id.imgTitle);
        TextView txtS = findViewById(R.id.txtStory);


        Bundle extras = getIntent().getExtras();
        String story = "Default Story Text";

        if (extras != null) {
            story = extras.getString("keyStory");
            if (story.equals("storyA")) {
                txtT.setText("सर्कसको हात्ती");
                imgT.setImageResource(R.drawable.elephant);
                txtS.setText("कुनै एक समयमा एउटा सर्कसमा पाँच हात्तीहरु थिए र उनीहरुले संधै सर्कसमा प्रदशन गर्नु पर्थ्यो । उनीहरुलाई सर्कसको मालिकले कमजोर डोरीले बाँधेको थियो ।\n" +
                        "\n" +
                        "हात्तीहरु निकै ठुलो र बलियो देखिन्थ्यो । तर पनि ति हात्तीहरुले कहिले पनि त्यो कमजोर डोरीलाई तोड्न प्रयास गरेनन् ।\n" +
                        "\n" +
                        "एक दिन, सर्कस हेर्न आएको एक व्यक्तिले सर्कसको मालिकलाई सोधे: “यी हात्तीहरु किन डोरी तोडेर नभागेका ? हेर्दा त सबै हात्ती बलबान देख्छु ।”\n" +
                        "\n" +
                        "सर्कसको मालिकले जवाफ दिए: “जब यी हात्तीहरु साना थिए, तब यिनीहरुलाई बलियो डोरीले बाँधियो । त्यो समय देखिनै यी हात्तीहरुलाई विश्वास गर्न लगाईयो कि उनीहरु रस्सी तोड्ने र भाग्न सक्ने बलिया छैनन्।” यो विश्वास को कारणले अब कमजोर डोरीले बाँधे पनि, उनीहरु कहिले पनि डोरी तोड्ने कोसिस गर्दैनन् ।\n" +
                        "\n" +
                        "कथाको पाठ : गर्न सक्छु भनेर बिस्वाश गर्नु नै गर्नु बराबर हो।\n  ");
            } else if (story.equals("storyB")) {
                txtT.setText("अलादीनको कथा");
                imgT.setImageResource(R.drawable.aaladin);
                txtS.setText("एक पटकको कुरा हो, त्यहाँ अलादीन नाम गरेको एक गरिब केटो थियो । उनीे आफ्नी आमासँगै बस्थ्यो । एक दिन त्यहाँ, एक धनी अपरिचित मानिस अलादीनको घर मा आयो ।\n" +
                        "\n" +
                        "त्यो मानिसले अलादीनकी आमालाई भन्यो “म एक व्यापारी हुँ । म अरबबाट आएको हुँ । म तपाईंको केटालाई काममा लैजान चाहन्छु । उस्को काम अनुसार धेरै पैसा तिर्नेछु अनि तिमी गरीब हुनु पर्ने छैन ।”\n" +
                        "\n" +
                        "अलादीनकी आमा चाँडै सहमत भए किनकि उनीहरूलाई वास्तवमै पैसाको आवश्यक थियो। तर उनीलाई थाहा थिएन कि त्यो व्यापारी हुँ भन्ने मानिस वास्तवमा एक जादूगर थियो ।\n" +
                        "\n" +
                        "भोलिपल्ट, अलादीनले आफ्ना सामानहरू राख्यो र व्यापारीसँगै गयो । तिनीहरूले धेरै घण्टा सम्म यात्रा गरे । एक ठाउँमा गएर व्यापारी रोकियो । अलादीन छक्क परे, किनकि त्यो एक्लो ठाउँ थियो । त्यहाँ केही पनि थिएन र कोही पनि थिएन ।\n" +
                        "\n" +
                        "व्यापारीले आफ्नो खल्तीबाट केही रंगीन पाउडर निकाले । त्यसपछि उसले त्यसलाई भुइँमा फालिदियो र त्यहाँ वरिपरि धुवाँ आयो । धुवाँ हटेपछि, अलादीनले जमीनमा एउटा गुफा जस्तो देखे । व्यापारीले अलादिनलाई ओडार भित्र जान भन्यो । “तिमीले भित्र धेरै सुन देख्नेछ, जुन तिमीले तिम्रो जीवनमा कैले पनि देख्न पाएको थिएन । तिमीले चाहेको जति सबै लिगेहुन्छ । तर गुफा भित्र तिमीले एक पुरानो बत्ती देख्नेछौ । मात्र त्यो बत्ती मेरो लागि ल्याईदेऊ ।”\n" +
                        "\n" +
                        "अलादीनलाई डर र संका लाग्यो तैपनि ऊ गुफाभित्र पसे । भित्र उनले देखे कि गुफा सुनले भरिएको थियो । उसले पहिले आफ्ना ब्यागहरु सुनले भरे र सके जति भरी हाले । जब उसको ब्यागमा अरु धेरै नअट्नी भयो, उसले बत्तीको लागि खोज्यो र भेट्टायो । त्यो बत्ती पुरानो र फोहोर थियो । उनले बत्ती र सुनले भरिएको ब्याग लिगे र व्यापारीलाई बोलाए ।\n" +
                        "\n" +
                        "तर व्यापारीले भने “मलाई त्यो बत्ती पहिले देऊ अनि तिमीलाई यो गुफाबाट निकाल्छु ।” अलादीन डराए कि यदि उनले त्यो व्यापारी लाई बत्ती दिए भने, उसले आफुलाई त्यहाँ छोडिदिन्छ ।\n" +
                        "\n" +
                        "त्यसैले उनले भने, “कृपया मलाई पहिले बाहिर निकाल्नुहोस् । ”\n" +
                        "\n" +
                        "यो कुरा सुनेर व्यापारी रिसाए र आफ्नो खल्तीबाट केही अरू पाउडर निकाले । उनले त्यसलाई गुफामा फ्याँकिदिए र गुफाको ढोका ठूलो ढुङ्गाले बन्द भयो । अलादीन डराए । उ भित्र थुनियोे र एक्लै भयो । कोई आएर मदत गर्छकि भनेर सहयोगको गुहार मागे । तर धेरै घण्टा बित्यो र कोही पनि आएनन् । अब अलादीन एक्लै रुन थाले ।\n" +
                        "\n" +
                        "रुँदा रुँदै उनको हातले त्यो व्यापारीले मागेको बत्तीमा घिस्रिन पुग्यो । अचानक, एउटा अनौंठो कुहिरोले गुफा भरियो र एउटा आवाजले भन्यो, “हे मेरो गुरु, म बत्तीको जिनी हुँ । जसले मलाई यो बत्ती रगटेर मलाई बाहिर निकाल्छ, म उहाँको गुलाम हुन्छु र उहाँको सबै इच्छा पुरा गर्दिन्छु । तपाईको इच्छा के हो?”\n" +
                        "\n" +
                        "त्यो जिनी एक विशाल मान्छे थियो र एकदम अनौंठो देखिन्थ्यो । त्यसैले पहिले त अलादीन उनीसँग डराए । तर जिनीले उनलाई आश्वासन दिए पछि बल्ल अलादिने उनीसँग डराएनन् ।\n" +
                        "अलादीनले भने, “मलाई मेरो घर जानुछ ।”\n" +
                        "\n" +
                        "आदेश पाएपछि जिनीले जादु गर्यो र अलादीन आफ्नो घर, आफ्नो आमासंग पुग्यो । तिनीहरू एक अर्कालाई अंगालो हाले र अलादीनले उनलाई जिनीको सबै कुरा बताए ।\n" +
                        "\n" +
                        "अलादीनले जिनिलाई फेरि बोलाए र उनी देखापर्यो तर अब तिनीहरू उनीसँग डराएनन् । उनले जिनीलाई दरबारको लागि आग्रह गरे र जिनीले तुरुन्तै सुन्दर दरबार त्यहाँ निकालदियो ।उनीहरु त्यसपछि तेही दरबारमा बस्न थाले ।\n" +
                        "\n" +
                        "अलादीनले आफ्नो नयाँ जीवन निकैनै खुसीसाथ बाँचिरहेका थिए । मानिसहरूलाई धनी अलादीनको बारेमा थाहा पाएपछि उनी अझ प्रख्यात भए। उनले अब सुल्तानकी छोरी राजकुमारीसँग विवाहगरे र उनीहरू अत्यन्त खुशी भए । तर अलादीनले राजकुमारसँग जिनीको करा गरेनन् ।\n" +
                        "\n" +
                        "अलादीनलाई व्यापारी बनेर झुक्याउन खेज्ने जादुगरले पनि अलादिनको बारेमा सुने। उनी अलादीनको दरबारमा ब्यापारी मान्छे भएको नाटक गरी आए जसले पुराना बत्तीहरू साटासाट गरेर नयाँ दिने गरेको थियो । उनी राजकुमार भाको ठाउँमा पुगे र सोधे “राजकुमारी तपाईकोमा पुरानो बत्ती भए मलाई दिनुस र यो गरिबलाई सहयोग गर्नुस ।”\n" +
                        "\n" +
                        "राजकुमारीले चारै तिर हेरे र अलादीनको पुरानो बत्ती देखे । उनले त्यो पुरानो नचाहिने बत्ती भनेर त्यो व्यापारीलाई दिए । जादुगरले हातमा समाउने बित्तिकै त्यो जिनी भएको बत्ती हो भनेर चिनीहाले र बत्ती लिगेर भागे ।\n" +
                        "\n" +
                        "जादुगरले बत्ती रगटेर जिनीलाई बोलायो र अब उनी जिनीको नयाँ गुरु थिए । उनले भने “अलादीनको दरबार यहाँबाट टाढा मरूभूमिमा सारीहाल ।”\n" +
                        "\n" +
                        "अलादीन घर फर्कंदा ऊ आफ्नो दरबार, आफ्नो राजकुमारी र आमालाई पाउन सकेन। ऊ धेरै चिन्तित भए, पछि उनले बुझे कि यो दुष्ट जादूगरको काम हो भनेर । तर उनी जादुगरको अगाडी कमजोर र शक्तिबिनाको थिए । अलादीनले कडा सोच्यो र याद गरे कि उनीसँग एउटा औंठी थियो जुन जादुगरले उनलाई दिएको थियो । उनमा अब आशा पलायो कि अझै पनि मौका हुन सक्छ भनेर । उसले औँठीमा घस्र्यो र अर्को सानो जीन देखापर्यो । त्यो सानो जिनिले एक मात्र कामना पुरा गर्न सक्थ्यो।अलादिनले भने “मलाई मेरी राजकुमारी जहाँ छ त्यहाँ लैजानुहोस् ।”\n" +
                        "अर्को क्षण अलादीन आफ्नै दरबारको मरुभूमिमा पुगे । र त्यो सानो जिनी पनि हरायो । उनको राजकुमारी त्यहाँ थियो र उनी सुरक्षित रहेको देखेर उनी खुशी भए ।\n" +
                        "\n" +
                        "तर दुष्ट जादूगर पनि त्यहाँ थियो र जिनीको बत्ती जादूगरको छेउको टेबुलमा राखिएको थियो । जादुगरले थाहा पाउनु अघिनै अलादीनले छिटो हामफाले र बत्ती समात्यो । उसले तुरुन्तै बत्ती\n" +
                        "रगटेर हेर्यो र त्यहाँ जिनी देखा पर्यो ।\n" +
                        "\n" +
                        "“मेरो गुरु” जीनले भने, “म तपाईंलाई फेरि सेवा गर्न पाउँदा खुसी छु । तपाई के चाहनुहुन्छ ?”\n" +
                        "\n" +
                        "अलादीनले जादूगरलाई हेरे र भने, “म यो दुष्ट जादूगरलाई अर्कै ठाउँमा पठाउन चाहन्छु, जहाँबाट ऊ फेरि कहिल्यै फर्केर वा कसैलाई हानि गर्न नसकोस् ।”\n" +
                        "जिनीले जादु गर्यो र त्यो दुष्ट जादूगर हरायो, फेरि कहिल्यै नफर्किने गरी हरायो ।\n" +
                        "\n" +
                        "जिनीले अलादिनलाई आफ्नो दरबार भएको ठाउँमा फर्कन सहयोग गर्यो । त्यहाँ अलादीन खुसीसाथ आफ्नो पत्नी र आमासँग बस्न थाले । जिनी, अलादीन र उनको परिवार पनि त्यही बसे");
            } else if (story.equals("storyC")) {
                txtT.setText("बाँदर र गोही\n");
                imgT.setImageResource(R.drawable.crocodile);
                txtS.setText("एकादेशमा एउटा पोखरी थियो र त्यो पोखरीको छेउंमा एउटा जामुन फलको रुख थियो। त्यो रुखमा एउटा बाँदर बस्थ्यो । उसले हरेक दिन मीठो जामुन टिप्दै खान्थ्यो ।\n" +
                        "\n" +
                        "एक पटक, उसले त्यो पोखरीमा एउटा गोहीलाई आराम गरेको देख्यो जो थकित र भोको देखिन्थ्यो । उनलाई त्यो गोही देखेर माया लाग्यो र केहि जामुन टिपेर खान दियो ।\n" +
                        "\n" +
                        "गोहीले जामुन खायो र उसलाई जामुन निकै स्वादिस्ट लाग्यो र उसले बाँदरलाई धन्यवाद दियो । दिन बित्दै गयो र उनीहरु एकदमै मिल्ने राम्रो साथी बने ।\n" +
                        "\n" +
                        "गोहीले सधैं केहि जामुन बचाएर आफ्नो श्रीमती गोहीलाई पनि लगिदिन्थ्यो । श्रीमती गोहीलाई पनि त्यो जामुन निकै नै स्वादिस्ट लाग्यो । तर गोहीको श्रीमती दुष्ट गोही थिइन् ।\n" +
                        "\n" +
                        "उनले आफ्नो श्रीमान गोहीलाई भनिन् : “त्यो बाँदरले दिएको जामुन त एस्तो स्वादिस्ट छ, उसको मुटु झन् कति स्वादिस्ट होला ? मलाई त्यो बाँदरको मुटु जसरी भएपनि खानु छ ।”\n" +
                        "यो कुरा सुनेर, गोही सुरुमा रिसाएको थियो तर आफ्नी श्रीमतीको इच्छालाई नाइँ भन्न सकेन ।\n" +
                        "\n" +
                        "भोलिपल्ट गोहिले बाँदरलाई गएर भन्यो: “बाँदर साथि, तिमि आज मसंगै घर जाम है । मेरी श्रीमतीले तिम्रो लागी निकै मिठो खाना बनाएर राखेको छ ।” बाँदर पनि साथीको घरको निम्तो पाउँदा खुसि भयो र जना तयार भयो ।\n" +
                        "\n" +
                        "उनीहरु आधा बाटो पुगेका थिए र गफै गफको तालमा, गोहिले आफ्नो श्रीमतीको सबै योजना बताईदियो । यो कुरा सुनेर बाँदर झसंग भयो र अब कसरी यो गोही बाट बच्ने होला भनेर सोच्न थाले ।\n" +
                        "\n" +
                        "बाँदर, चतुर भएकोले, उसले गोहीलाई भन्यो, “लौ जा, तपाईंको श्रीमतीलाई मेरो मुटु चाहेको रहेछ तर मैले त मुटु बिर्सेर जामुनको बोटमै पो छोडेर आए ।” मुर्ख गोहीले बाँदरको कुरा पत्ताएर बाँदरलाई त्येही जामुनको बोट भएको ठाउंमा फिर्ता लगे ।\n" +
                        "\n" +
                        "जामुनको बोट देख्नी बितिकै बाँदर फुत्त उफ्रेर रुखमा चडीहाले । रुखमा पुगेसी बाँदरले गोहीलाई भन्यो, “कसले आफ्नो मुटु झिकेर अन्तै राख्न सक्छ र ? तिमीले मेरो विश्वासलाई धोका दियौ । हामी फेरि कहिल्यै साथी बन्न सक्दैनौं ।\n" +
                        "\n" +
                        "त्यसपछी गोही सधैं एक्लो र भोको भयो ।\n" +
                        "\n" +
                        "आफ्नो साथीलाई कहिले पनि धोका नदिनु।\n");
            } else if (story.equals("storyD")) {
                txtT.setText("नँया सोच");
                imgT.setImageResource(R.drawable.nayasoch);
                txtS.setText("एकादेशको कुरा हो, एउटा गाँउमा बूढा र बूढी मिलेर घरमा बस्दथे र सँधै एक अर्कालाई माया गर्दथे । उनीहरुको चार छोरी मात्र थियो । अरु गाँउलेहरु ती बूढा र बूढीको एक अर्काको माया देखेर छक्कै पर्दथे ।\n" +
                        "\n" +
                        "दिन बित्दै थियो । उनीहरुको छोरीहरु पनि ठुली हुँदै गयो । अब भने बूढा बुढीलाई आफ्नो छोरीहरुको चिन्ता हुन थाल्यो । उनीहरु निकै गरिब थिए । चारै छोरीहरु मिहिनेती थिए । छोरीहरुको काम बाट उनीहरुको घर चलिरहेको थियो । तर छोरीहरुको बिहे गर्दिनको लागि उनीहरुसँग केही सम्पति थिएन । सम्पतिको नाममा त्यही एक घर र केही बाख्राहरु थिए ।\n" +
                        "\n" +
                        "छोरीहरु सबैको बिहेको उमेर पनि भइसकेको र त्यो एउटा घर बेचेर चारै छोरीको बिहे पनि सम्भव थिएन । बिहेको चिन्ताले बूढाबुढीको मन पोलिरहन्थ्यो । अब त बूढालाई खाना पनि खान मन लाग्न छाड्यो । बूढाको यो अबस्था देखेर सबैलाइ चिन्ता हुन्थ्यो तर सबै परिवारले सम्झाउदा पनि बूढाको मन भरिएन ।\n" +
                        "\n" +
                        "तर एकदिन बूढालाइ नँया सोच आयो । यस्तो सोच जून गाँउमा अहिलेसम्म कसैले गरेको थिएन । बूढाले आफ्नो चार छोरीहरुको बिहे चार जनावर सँग गर्ने विचार गर्यो ।\n" +
                        "सुरु मा परिवारको कसैले यो कुरा मानेन तर बूढाले धेरै सम्झउँदा छोरीहरु पनि माने ।\n" +
                        "त्यसैले बूढाले जेठी छोरीको बिहे बाघसँग, माहीली छारीको भालुसँग, साँहीलीको र्सपसँग र कान्छीको चरासँग गर्दियो ।\n" +
                        "सबै गाउँले छक्क परेपनि छोरीहरुको जिवन निकैनै राम्रो सँग कट्न थाल्यो र बूढाबूढी पनि खुसी भए ।\n" +
                        "केही बर्ष पछि बूढालाई आफ्नो छोरीहरुको याद आयो र भेट्न भनी घरबाट निस्कियो ।\n" +
                        "\n" +
                        "पहिले जेठी छोरीको घरमा जाने निर्णय गरेर, बाघ ज्वाँइलाई भेट्न ओडारमा पुग्यो । बाघ पनि आफ्नो ससुरोलाइ देखेर खुसी भयो ।\n" +
                        "त्यसपछि बाघले आफ्नो बूढीलाई भन्यो –“ल तिमी पानी तताएर ठिक पार्नु, म र ससुरा मिलेर एउटा बाख्रा लिएर आँउछु ।” बाघ र ससुरा डुल्डै एउटा गाउँमा पुगे र पर एउटा बाख्राको गोठ देखे । गोठमा पुगेर बाघले भन्यो –“ल ससुरा बा, म भित्र जान्छु र फुत्त एउटा बाख्रा फाल्छु । तपाई त्यसलाई च्याप समाएर सिस्नोको झाँङमा फाल्नुहोस ।”\n" +
                        "बुढा तयार भएर बसे र बाघ ज्वाँइले बाख्रा फाल्दा च्याप समाएर सिस्नोमा फाले । पछि ओडार फर्केर मासु बनाएर निकै रमाइलो को साथ बुढाले खाए । त्यसरी एक महिना जति बसी सकेपछि बुढालाई बल्ल आफ्नो बुढीको याद आयो र छोरी ज्वाँइ सँग बिदा मागेर घर फर्किए ।\n" +
                        "\n" +
                        "घरमा पुगेर बुढाले सबै करा बुढीलाइ सुनाए । त्यसपछि बुढीले भने –“तपाईलाई पो ज्वाँइले खुवाउँछ, मलाई को छ र खवाउने?”\n" +
                        "अनि बूढाले भने–“म छँदैछुनी, तँ किन आत्तिन्छे?”\n" +
                        "त्यसपछि बूढाले पनि आफ्नो ज्वाँइ जस्तै गरी बूढीलाई लिगेर एउटा गोठमा पुग्यो ।\n" +
                        "\n" +
                        "त्यसपछि बूढीलाई भन्यो–“तिमी बाहिरनै बस, म भित्र गएर बाख्रालाई फुत्त फ्याल्छु अनि तिमी त्यसलाई च्याप्प समातेर सिस्नोको झाँङमा फाल है ।”\n" +
                        "\n" +
                        "अनि बूढा गोठ भित्र मात्रै के पुगेथ्यो, एउटा ठुलो बोकोले लात्तीले हान्दियो । बूढा त सिधै बुढीको हातमापो पुग्यो । बुढीले चैँ बाख्रा आयो भनेर सिस्नोको झाँङमा फाल्दियो । बुढाले आथ्था, पोल्यो भनेसीपो बुढीले चाल पायो । बल्ल बल्ल बूढा बूढी त्यहाँ बाट निस्केर घर पुगे । बूढो त एक महिना नै बिरामी भयो ।\n" +
                        "\n" +
                        "बिरामी बाट उठेसी फेरी बूढालाइ आफ्नो छोरीको याद आयो । अब चाँहि बूढा माहिली छोरीलाइ भेट्न जान्छु भनी हिड्यो । धेरै लामो जङगलको बाटो हिडेँसी भालु ज्वाँइ लाइ भेट्यो ।\n" +
                        "भालुले पनि आफ्नो ससुरालाइ सम्मान गर्यो र आफ्नो बुढीलाइ भन्योे–“ल तिमी कराइ तताएर राख्नु म पहिले तेल लिएर आँउछु । ” भालु र ससुरा तेल पेल्ने ठाँउमा पुग्यो । भालुलाइ देखेर त्यहाँको सबै मान्छे भागे । अनि भालुले भएभरको तेल आफ्नो चाकमा दले । अनि घर पुगेर तताइ रहेको कराहीमा थचक्क बस्यो । भालुको शरिरमा टाँसेको सबै तेल कराहीमा जम्मा भयो ।\n" +
                        "\n" +
                        "त्यसपछि फेरी भालुले आफ्नो बूढीलाई भन्यो–“अब म पिठो लिगेर आउँछु, तिमी सेल रोटि बनाउनु । आज ससुराबा लाई खुब रोटि खुवाउनु पर्छ है ।”\n" +
                        "\n" +
                        "भालु र बूढा मिलेर पिठो बेच्ने दोकानमा पनि पुग्यो र टन्नै पिठो लिगेर फर्कियो । त्यो दिन बूढाले टन्नै सेल खायो । एक महिना जति आनन्दले बसेपछि बल्ल बूढीको सम्झना आउन थाल्यो । भालु र छोरीलाइ बिदा मागी घर फर्कियो ।\n" +
                        "\n" +
                        "घरमा बूढीले सबैकुरा सोध्यो र बूढाले पनि टन्नै सेल खाएको कुरा भने । त्यसपछि बूढीले भन्न थालीे–“तपाईलाई पो ज्वाँइले खुवाउँछ, मलाई कसले खुवाउँछ र ?”\n" +
                        "\n" +
                        "बूढाले पनि भन्यो–“त किन आत्तेको म छँदैछुनी, चिन्ता नगर न ।”\n" +
                        "अर्को दिन बूढाले भन्यो–“ए बुढी, तिमी कराही तताएर बस, म तेल र पिठो लिगेर आँउछु ।”\n" +
                        "\n" +
                        "अनि बूढा तेल भाको ठाँउमा पुग्यो । सबैजना गइसकेसपछि अलि अलि पाएको तेल उसले भालुले गरे जसरीनै आफ्नो ज्यानमा दल्यो । घर आई र्भखरै तातेको कराहीमा के बसेको थियो, उसको चाकनै डढ्यो । बल्ल बल्ल बूढीले कराही बाट निकाली । फेरी एक महिना बूढा बिरामी भयो ।\n" +
                        "\n" +
                        "त्यसपछि बूढा साँहीली छोरीलाई भेट्न भनी घरबाट निस्कीयो । धेरै हिँडेपछि बल्ल आफ्नो छोरी र सर्प ज्वाँइ भेट्यो । सर्पले पनि आफ्नो ससुरोलाइ भन्यो–“तपाइको अरु ज्वाँइले त के के खाना खुवायो होला । म चाँहि तपाइलाई पुरै पाताल लोक घुमाउँछु ।” त्यसपछि बूढा सर्प ज्वाँइको ज्यानमा बस्यो । सर्पले पनि एउटा दुलो बाट छिरेर पुरै पाताल घुमाइ दियो । सँधै एसरी घुम्दा घुम्दै महिनौ बितेको चालनै पाएन । पछि उनी बूढीको सम्झना आएसी आफ्नो घर फर्किए ।\n" +
                        "\n" +
                        "घर पुगेर आफु पुरै पाताल लोक घुमेको कुरा आफ्नो बूढीलाइ बतायो । त्यसपछि फेरी बूढीले भन्न थाली तपाइलाइ पो ज्वाँइले घुमाउनु भयो, मलाइ कसले घुमाँउछ र?\n" +
                        "अनि बूढाले भन्यो–“म घुमाइहाल्छु नी चिन्ता नगर न । ”\n" +
                        "\n" +
                        "भोली बिहान बूढा र बूढी एउटा दुलो को अगाडि बसेर तयार भयो । बूढी आफ्नो बूढाको ज्यानमा थचक्क बसी । त्यसपछि बूढा सकिनसकि दुलो भित्र छिर्न थाल्यो । अलिकति भित्र के पुगेथ्यो, उनीहरु त्यही अड्कीयो । बूढीले बल्ल बल्ल तानेर बाहिर निकाल्यो । तर बूढाको ज्यानको पुरै छाला गयो । फेरी पनि बूढो बिरामी भएर घरमै आराम गर्नु पर्यो ।\n" +
                        "\n" +
                        "सन्चो भएपछि अब कान्छी छोरीलाइ भेट्न भनि बूढा घरबाट निस्कियो । एउटा ठुलो रुख चढेपछि बल्ल चरा ज्वाँइ भेट्यो । चरा ज्वाँइले चाँहि म तपाइलाई पुरा विश्व आकाशबाट घुमाउछु भन्यो । बूढा पनि खुसी भयो । एक महिना जसो उनीहरु नँया नँया ठाँउ घुमे । पछि बूढो घुमेको मिठो सम्झना बोकी घर फर्किए ।\n" +
                        "\n" +
                        "घर पुगेसी उनले आफ्नो बूढीलाइ पनि ज्वाँइले जसरीनै घुमाउने कुरो गरे । भोली बिहान बूढा र बूढी एउटा पहाडको अग्लो ठाँउमा पुगे ।\n" +
                        "\n" +
                        "दुइवटा नाङ्गलो दुइ हातमा बाँदेर पङ्खा जस्तो बनाए । अनि बूढीलाइ आफ्नो पिठ्युमा राखी त्यहाँ बाट हामफाल्यो । त्यसपछि त्यो गाँउमा बूढा बूढी कहिले पनि देखा परेनन् । हामफाल्न त सँगै हामफालेको थियो तर मर्ने बेलामा सँगै पनि भएनन् । फरक फरक ठाँउमा उनीहरुको शरीर भेटियो ।\n");

            }

            btnBac.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {
                    Intent ca = new Intent(getApplicationContext(), MainActivity.class);
                    startActivity(ca);
                }
            });
        }
    }}